/* 计科 2253731 张皓钦 */
#include <iostream>
#include <conio.h>
#include "../include/cmd_console_tools.h"
#include "90-01-b1-hanoi.h"
#include "../include/menu.h"
using namespace std;
const char ops[9][100] = { "基本解",
"基本解(步数记录)",
"内部数组显示(横向)",
"内部数组显示(纵向+横向)",
"图形解-预备-画三个圆柱",
"图形解-预备-在起始柱上画n个盘子",
"图形解-预备-第一次移动",
"图形解-自动移动版本",
"图形解-游戏版" };
/* ----------------------------------------------------------------------------------

     本文件功能：
	1、放main函数
	2、初始化屏幕
	3、调用菜单函数（hanoi_menu.cpp中）并返回选项
	4、根据选项调用菜单各项对应的执行函数（hanoi_multiple_solutions.cpp中）

     本文件要求：
	1、不允许定义全局变量（含外部全局和静态全局，const及#define不在限制范围内）
	2、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	3、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	/* demo中首先执行此句，将cmd窗口设置为40行x120列（缓冲区宽度120列，行数9000行，即cmd窗口右侧带有垂直滚动杆）*/
	cct_setconsoleborder(120, 40, 120, 9000);
	while(1){
		int option = menu("int",ops,9);
		if (!option)
			break;
		switch (option) {
			case 5:
				cct_cls();
				print_column(option);
				break;
			default:
				hanoi(option);
		}
		if (option >= 4)
			cct_gotoxy(0, 38);
		else
			cout << endl;
		cout << "按回车键继续";
		while (_getch() != '\r')
			;
	}

	return 0;
}
